{
    "Identifier": "eos30f3",
    "Slug": "dmpnn-herg",
    "Status": "In progress",
    "Title": "Prediction of hERG Channel Blockers with Directed Message Passing Neural Networks",
    "Description": 
        "This model is a predictive model for identifying hERG (human ether-à-go-go-related gene) blockers. The model presents an approach to predicting compounds with hERG-induced cardiotoxicity. The model uses Deep Molecular Graph Neural Networks (D-MPNN), which is a specialized deep learning design for molecules, that is used to understand complex connections within chemical compounds. The model uses D-MPNN with moe206 descriptors. The model's performance was evaluated on Cai's hERG dataset under various validation setups, including scaffold split and random split. The model's performance metrics, that is the Area Under the Receiver Operating Characteristic curve (AUC-ROC), show its effectiveness. The model outperforms other classifiers, which shows that the model is efficient in predicting hERG blockers. The model's interpretability is explained through SHAP (SHapley Additive exPlanations) analysis, which identifies key molecular descriptors influencing predictions. The key descriptors influencing predictions include h_pavgQ, logP(o/w), SlogP, vsa_pol, h_logD, and h_pkB, which aligns with known characteristics of hERG blockers. The model has a few limitations, including the need for larger datasets to enhance the training and performance of the D-MPNN + moe206 model. In conclusion, the presented model D-MPNN with moe206 descriptors is one of the best classification models for evaluating hERG blockers. Its performance contributes to the advancement of in silico methods for predicting compounds with potential hERG-induced cardiotoxicity, addressing an important aspect of drug safety in the field of drug development and can help in identifying potential risks early on."
    ,
    "Mode": "Pretrained",
    "Task": ["Classification"],
    "Input": ["Compound"],
    "Input Shape": "List",
    "Output": ["Probability"],
    "Output Type": ["Float"],
    "Output Shape": "List",
    "Interpretation": "The results represent predictions from the model for different chemical compounds. it indicates how likely the model thinks each compound might cause heart-related issues (hERG blockers).Higher scores suggest a higher likelihood.",
    "Tag": [
        "hERG",
        "channel-blockers",
        "DMPNN"
    ],
    "Publication": "https://pubs.rsc.org/en/content/articlehtml/2022/ra/d1ra07956e",
    "Source Code": "https://github.com/AI-amateur/DMPNN-hERG",
    "License": "MIT"
}
